LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
/**
 *
 * @file MPU_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_MPU_PERIPHERAL_REGISTER_MPU_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_MPU_PERIPHERAL_REGISTER_MPU_REGISTERDEFINES_H_

#include <xDriver_MCU/Core/MPU/Peripheral/xHeader/MPU_Enum.h>

/**********************************************************************************************
************************************** 1 TYPER ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_TYPER_R_SEPARATE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_TYPER_R_SEPARATE_BIT    (0UL)
#define MPU_TYPER_R_SEPARATE_UNIFIED    ((UBase_t) 0x00000000UL)
#define MPU_TYPER_R_SEPARATE_SEPARATE    ((UBase_t) 0x00000001UL)

#define MPU_TYPER_SEPARATE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_TYPER_SEPARATE_UNIFIED    ((UBase_t) 0x00000000UL)
#define MPU_TYPER_SEPARATE_SEPARATE    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_TYPER_R_DREGION_MASK    ((UBase_t) 0x0000FF00UL)
#define MPU_TYPER_R_DREGION_BIT    (8UL)
#define MPU_TYPER_R_DREGION_D8    ((UBase_t) 0x00000800UL)
#define MPU_TYPER_R_DREGION_D16    ((UBase_t) 0x00000F00UL)

#define MPU_TYPER_DREGION_MASK    ((UBase_t) 0x000000FFUL)
#define MPU_TYPER_DREGION_D8    ((UBase_t) 0x00000008UL)
#define MPU_TYPER_DREGION_D16    ((UBase_t) 0x0000000FUL)
/*--------*/

/*--------*/
#define MPU_TYPER_R_IREGION_MASK    ((UBase_t) 0x00FF0000UL)
#define MPU_TYPER_R_IREGION_BIT    (16UL)
#define MPU_TYPER_R_IREGION_I0    ((UBase_t) 0x00000000UL)

#define MPU_TYPER_IREGION_MASK    ((UBase_t) 0x000000FFUL)
#define MPU_TYPER_IREGION_I0    ((UBase_t) 0x00000000UL)
/*--------*/

/**********************************************************************************************
************************************** 2 CTRL ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_CTRL_R_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_CTRL_R_ENABLE_BIT    (0UL)
#define MPU_CTRL_R_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_R_ENABLE_ENA    ((UBase_t) 0x00000001UL)

#define MPU_CTRL_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_CTRL_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_ENABLE_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_CTRL_R_HFNMIENA_MASK    ((UBase_t) 0x00000002UL)
#define MPU_CTRL_R_HFNMIENA_BIT    (1UL)
#define MPU_CTRL_R_HFNMIENA_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_R_HFNMIENA_ENA    ((UBase_t) 0x00000002UL)

#define MPU_CTRL_HFNMIENA_MASK    ((UBase_t) 0x00000001UL)
#define MPU_CTRL_HFNMIENA_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_HFNMIENA_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_CTRL_R_PRIVDEFENA_MASK    ((UBase_t) 0x00000004UL)
#define MPU_CTRL_R_PRIVDEFENA_BIT    (2UL)
#define MPU_CTRL_R_PRIVDEFENA_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_R_PRIVDEFENA_ENA    ((UBase_t) 0x00000004UL)

#define MPU_CTRL_PRIVDEFENA_MASK    ((UBase_t) 0x00000001UL)
#define MPU_CTRL_PRIVDEFENA_DIS    ((UBase_t) 0x00000000UL)
#define MPU_CTRL_PRIVDEFENA_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/**********************************************************************************************
**************************************3 RNR ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RNR_R_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RNR_R_REGION_BIT    (0UL)
#define MPU_RNR_R_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RNR_R_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RNR_R_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RNR_R_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RNR_R_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RNR_R_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RNR_R_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RNR_R_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RNR_R_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RNR_R_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RNR_R_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RNR_R_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RNR_R_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RNR_R_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RNR_R_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RNR_R_REGION_REG15    ((UBase_t) 0x0000000FUL)

#define MPU_RNR_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RNR_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RNR_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RNR_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RNR_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RNR_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RNR_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RNR_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RNR_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RNR_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RNR_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RNR_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RNR_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RNR_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RNR_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RNR_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RNR_REGION_REG15    ((UBase_t) 0x0000000FUL)
/*--------*/

/**********************************************************************************************
**************************************4 RBAR ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RBAR_R_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RBAR_R_REGION_BIT    (0UL)
#define MPU_RBAR_R_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RBAR_R_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RBAR_R_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RBAR_R_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RBAR_R_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RBAR_R_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RBAR_R_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RBAR_R_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RBAR_R_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RBAR_R_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RBAR_R_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RBAR_R_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RBAR_R_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RBAR_R_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RBAR_R_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RBAR_R_REGION_REG15    ((UBase_t) 0x0000000FUL)

