LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RBAR_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RBAR_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RBAR_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RBAR_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RBAR_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RBAR_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RBAR_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RBAR_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RBAR_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RBAR_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RBAR_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RBAR_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RBAR_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RBAR_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RBAR_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RBAR_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RBAR_REGION_REG15    ((UBase_t) 0x0000000FUL)
/*--------*/

/*--------*/
#define MPU_RBAR_R_VALID_MASK    ((UBase_t) 0x00000010UL)
#define MPU_RBAR_R_VALID_BIT    (4UL)
#define MPU_RBAR_R_VALID_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RBAR_R_VALID_ENA    ((UBase_t) 0x00000010UL)

#define MPU_RBAR_VALID_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RBAR_VALID_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RBAR_VALID_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RBAR_R_ADDR_MASK    ((UBase_t) 0xFFFFFFE0UL)
#define MPU_RBAR_R_ADDR_BIT    (5UL)

#define MPU_RBAR_ADDR_MASK    ((UBase_t) 0x01FFFFFFUL)
/*--------*/

/**********************************************************************************************
**************************************5 RASR ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RASR_R_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_R_ENABLE_BIT    (0UL)
#define MPU_RASR_R_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_ENABLE_ENA    ((UBase_t) 0x00000001UL)

#define MPU_RASR_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR_ENABLE_ENA    ((UBase_t) 0x00000001UL)
/*--------*/


/*--------*/
#define MPU_RASR_R_SIZE_MASK    ((UBase_t) 0x0000003EUL)
#define MPU_RASR_R_SIZE_BIT    (1UL)
#define MPU_RASR_R_SIZE_32B    ((UBase_t) 0x00000008UL)
#define MPU_RASR_R_SIZE_1KB    ((UBase_t) 0x00000012UL)
#define MPU_RASR_R_SIZE_1MB    ((UBase_t) 0x00000026UL)
#define MPU_RASR_R_SIZE_1GB    ((UBase_t) 0x0000003AUL)
#define MPU_RASR_R_SIZE_4GB    ((UBase_t) 0x0000003EUL)

#define MPU_RASR_SIZE_MASK    ((UBase_t) 0x0000001FUL)
#define MPU_RASR_SIZE_32B    ((UBase_t) 0x00000004UL)
#define MPU_RASR_SIZE_1KB    ((UBase_t) 0x00000009UL)
#define MPU_RASR_SIZE_1MB    ((UBase_t) 0x00000013UL)
#define MPU_RASR_SIZE_1GB    ((UBase_t) 0x0000001DUL)
#define MPU_RASR_SIZE_4GB    ((UBase_t) 0x0000001FUL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD_MASK    ((UBase_t) 0x0000FF00UL)
#define MPU_RASR_R_SRD_BIT    (8UL)
#define MPU_RASR_R_SRD_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD_DIS    ((UBase_t) 0x0000FF00UL)

#define MPU_RASR_SRD_MASK    ((UBase_t) 0x000000FFUL)
#define MPU_RASR_SRD_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD_DIS    ((UBase_t) 0x000000FFUL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD0_MASK    ((UBase_t) 0x00000100UL)
#define MPU_RASR_R_SRD0_BIT    (8UL)
#define MPU_RASR_R_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD0_DIS    ((UBase_t) 0x00000100UL)

#define MPU_RASR_SRD0_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD0_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD1_MASK    ((UBase_t) 0x00000200UL)
#define MPU_RASR_R_SRD1_BIT    (9UL)
#define MPU_RASR_R_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD1_DIS    ((UBase_t) 0x00000200UL)

#define MPU_RASR_SRD1_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD1_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD2_MASK    ((UBase_t) 0x00000400UL)
#define MPU_RASR_R_SRD2_BIT    (10UL)
#define MPU_RASR_R_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD2_DIS    ((UBase_t) 0x00000400UL)

#define MPU_RASR_SRD2_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD2_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD3_MASK    ((UBase_t) 0x00000800UL)
#define MPU_RASR_R_SRD3_BIT    (11UL)
#define MPU_RASR_R_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD3_DIS    ((UBase_t) 0x00000800UL)

#define MPU_RASR_SRD3_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD3_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD4_MASK    ((UBase_t) 0x00001000UL)
#define MPU_RASR_R_SRD4_BIT    (12UL)
#define MPU_RASR_R_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD4_DIS    ((UBase_t) 0x00001000UL)

#define MPU_RASR_SRD4_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD4_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD5_MASK    ((UBase_t) 0x00002000UL)
#define MPU_RASR_R_SRD5_BIT    (13UL)
#define MPU_RASR_R_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD5_DIS    ((UBase_t) 0x00002000UL)

#define MPU_RASR_SRD5_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD5_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD6_MASK    ((UBase_t) 0x00004000UL)
#define MPU_RASR_R_SRD6_BIT    (14UL)
#define MPU_RASR_R_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD6_DIS    ((UBase_t) 0x00004000UL)

#define MPU_RASR_SRD6_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_SRD6_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD7_MASK    ((UBase_t) 0x00008000UL)
#define MPU_RASR_R_SRD7_BIT    (15UL)
#define MPU_RASR_R_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR_R_SRD7_DIS    ((UBase_t) 0x00008000UL)

