LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RASR1_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_ENABLE_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SIZE_MASK    ((UBase_t) 0x0000003EUL)
#define MPU_RASR1_R_SIZE_BIT    (1UL)
#define MPU_RASR1_R_SIZE_32B    ((UBase_t) 0x00000008UL)
#define MPU_RASR1_R_SIZE_1KB    ((UBase_t) 0x00000012UL)
#define MPU_RASR1_R_SIZE_1MB    ((UBase_t) 0x00000026UL)
#define MPU_RASR1_R_SIZE_1GB    ((UBase_t) 0x0000003AUL)
#define MPU_RASR1_R_SIZE_4GB    ((UBase_t) 0x0000003EUL)

#define MPU_RASR1_SIZE_MASK    ((UBase_t) 0x0000001FUL)
#define MPU_RASR1_SIZE_32B    ((UBase_t) 0x00000004UL)
#define MPU_RASR1_SIZE_1KB    ((UBase_t) 0x00000009UL)
#define MPU_RASR1_SIZE_1MB    ((UBase_t) 0x00000013UL)
#define MPU_RASR1_SIZE_1GB    ((UBase_t) 0x0000001DUL)
#define MPU_RASR1_SIZE_4GB    ((UBase_t) 0x0000001FUL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD0_MASK    ((UBase_t) 0x00000100UL)
#define MPU_RASR1_R_SRD0_BIT    (8UL)
#define MPU_RASR1_R_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD0_DIS    ((UBase_t) 0x00000100UL)

#define MPU_RASR1_SRD0_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD0_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD1_MASK    ((UBase_t) 0x00000200UL)
#define MPU_RASR1_R_SRD1_BIT    (9UL)
#define MPU_RASR1_R_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD1_DIS    ((UBase_t) 0x00000200UL)

#define MPU_RASR1_SRD1_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD1_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD2_MASK    ((UBase_t) 0x00000400UL)
#define MPU_RASR1_R_SRD2_BIT    (10UL)
#define MPU_RASR1_R_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD2_DIS    ((UBase_t) 0x00000400UL)

#define MPU_RASR1_SRD2_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD2_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD3_MASK    ((UBase_t) 0x00000800UL)
#define MPU_RASR1_R_SRD3_BIT    (11UL)
#define MPU_RASR1_R_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD3_DIS    ((UBase_t) 0x00000800UL)

#define MPU_RASR1_SRD3_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD3_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD4_MASK    ((UBase_t) 0x00001000UL)
#define MPU_RASR1_R_SRD4_BIT    (12UL)
#define MPU_RASR1_R_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD4_DIS    ((UBase_t) 0x00001000UL)

#define MPU_RASR1_SRD4_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD4_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD5_MASK    ((UBase_t) 0x00002000UL)
#define MPU_RASR1_R_SRD5_BIT    (13UL)
#define MPU_RASR1_R_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD5_DIS    ((UBase_t) 0x00002000UL)

#define MPU_RASR1_SRD5_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD5_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD6_MASK    ((UBase_t) 0x00004000UL)
#define MPU_RASR1_R_SRD6_BIT    (14UL)
#define MPU_RASR1_R_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD6_DIS    ((UBase_t) 0x00004000UL)

#define MPU_RASR1_SRD6_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD6_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD7_MASK    ((UBase_t) 0x00008000UL)
#define MPU_RASR1_R_SRD7_BIT    (15UL)
#define MPU_RASR1_R_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_SRD7_DIS    ((UBase_t) 0x00008000UL)

#define MPU_RASR1_SRD7_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_SRD7_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_B_MASK    ((UBase_t) 0x00010000UL)
#define MPU_RASR1_R_B_BIT    (16UL)
#define MPU_RASR1_R_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_B_ENA    ((UBase_t) 0x00010000UL)

#define MPU_RASR1_B_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_B_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_C_MASK    ((UBase_t) 0x00020000UL)
#define MPU_RASR1_R_C_BIT    (17UL)
#define MPU_RASR1_R_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_C_ENA    ((UBase_t) 0x00020000UL)

#define MPU_RASR1_C_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_C_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_S_MASK    ((UBase_t) 0x00040000UL)
#define MPU_RASR1_R_S_BIT    (18UL)
#define MPU_RASR1_R_S_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_S_ENA    ((UBase_t) 0x00040000UL)

#define MPU_RASR1_S_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_S_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_S_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_TEX_MASK    ((UBase_t) 0x00380000UL)
#define MPU_RASR1_R_TEX_BIT    (19UL)
#define MPU_RASR1_R_TEX_NC    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_TEX_WB_WRA    ((UBase_t) 0x00080000UL)
#define MPU_RASR1_R_TEX_WT_NWA    ((UBase_t) 0x00100000UL)
#define MPU_RASR1_R_TEX_WB_NWA    ((UBase_t) 0x00180000UL)

#define MPU_RASR1_TEX_MASK    ((UBase_t) 0x00000007UL)
#define MPU_RASR1_TEX_NC    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_TEX_WB_WRA    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_TEX_WT_NWA    ((UBase_t) 0x00000002UL)
#define MPU_RASR1_TEX_WB_NWA    ((UBase_t) 0x00000003UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_AP_MASK    ((UBase_t) 0x07000000UL)
#define MPU_RASR1_R_AP_BIT    (24UL)
#define MPU_RASR1_R_AP_NANA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_AP_RWNA    ((UBase_t) 0x01000000UL)
#define MPU_RASR1_R_AP_RWRO    ((UBase_t) 0x02000000UL)
#define MPU_RASR1_R_AP_RWRW    ((UBase_t) 0x03000000UL)
#define MPU_RASR1_R_AP_RONA    ((UBase_t) 0x05000000UL)
#define MPU_RASR1_R_AP_RORO    ((UBase_t) 0x06000000UL)

#define MPU_RASR1_AP_MASK    ((UBase_t) 0x00000007UL)
#define MPU_RASR1_AP_NANA    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_AP_RWNA    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_AP_RWRO    ((UBase_t) 0x00000002UL)
#define MPU_RASR1_AP_RWRW    ((UBase_t) 0x00000003UL)
#define MPU_RASR1_AP_RONA    ((UBase_t) 0x00000005UL)
#define MPU_RASR1_AP_RORO    ((UBase_t) 0x00000006UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_XN_MASK    ((UBase_t) 0x10000000UL)
#define MPU_RASR1_R_XN_BIT    (28UL)
#define MPU_RASR1_R_XN_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_R_XN_ENA    ((UBase_t) 0x10000000UL)

#define MPU_RASR1_XN_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR1_XN_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR1_XN_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/**********************************************************************************************
**************************************8 RBAR2 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RBAR2_R_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RBAR2_R_REGION_BIT    (0UL)
#define MPU_RBAR2_R_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RBAR2_R_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RBAR2_R_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RBAR2_R_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RBAR2_R_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RBAR2_R_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RBAR2_R_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RBAR2_R_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RBAR2_R_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RBAR2_R_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RBAR2_R_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RBAR2_R_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RBAR2_R_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RBAR2_R_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RBAR2_R_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RBAR2_R_REGION_REG15    ((UBase_t) 0x0000000FUL)

#define MPU_RBAR2_REGION_MASK    ((UBase_t) 0x0000000FUL)
#define MPU_RBAR2_REGION_REG0    ((UBase_t) 0x00000000UL)
#define MPU_RBAR2_REGION_REG1    ((UBase_t) 0x00000001UL)
#define MPU_RBAR2_REGION_REG2    ((UBase_t) 0x00000002UL)
#define MPU_RBAR2_REGION_REG3    ((UBase_t) 0x00000003UL)
#define MPU_RBAR2_REGION_REG4    ((UBase_t) 0x00000004UL)
#define MPU_RBAR2_REGION_REG5    ((UBase_t) 0x00000005UL)
#define MPU_RBAR2_REGION_REG6    ((UBase_t) 0x00000006UL)
#define MPU_RBAR2_REGION_REG7    ((UBase_t) 0x00000007UL)
#define MPU_RBAR2_REGION_REG8    ((UBase_t) 0x00000008UL)
#define MPU_RBAR2_REGION_REG9    ((UBase_t) 0x00000009UL)
#define MPU_RBAR2_REGION_REG10    ((UBase_t) 0x0000000AUL)
#define MPU_RBAR2_REGION_REG11    ((UBase_t) 0x0000000BUL)
#define MPU_RBAR2_REGION_REG12    ((UBase_t) 0x0000000CUL)
#define MPU_RBAR2_REGION_REG13    ((UBase_t) 0x0000000DUL)
#define MPU_RBAR2_REGION_REG14    ((UBase_t) 0x0000000EUL)
#define MPU_RBAR2_REGION_REG15    ((UBase_t) 0x0000000FUL)
/*--------*/

/*--------*/
#define MPU_RBAR2_R_VALID_MASK    ((UBase_t) 0x00000010UL)
#define MPU_RBAR2_R_VALID_BIT    (4UL)
#define MPU_RBAR2_R_VALID_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RBAR2_R_VALID_ENA    ((UBase_t) 0x00000010UL)

