LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RBAR2_VALID_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RBAR2_VALID_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RBAR2_VALID_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RBAR2_R_ADDR_MASK    ((UBase_t) 0xFFFFFFE0UL)
#define MPU_RBAR2_R_ADDR_BIT    (5UL)

#define MPU_RBAR2_ADDR_MASK    ((UBase_t) 0x01FFFFFFUL)
/*--------*/

/**********************************************************************************************
**************************************9 RASR2 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RASR2_R_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_R_ENABLE_BIT    (0UL)
#define MPU_RASR2_R_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_ENABLE_ENA    ((UBase_t) 0x00000001UL)

#define MPU_RASR2_ENABLE_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_ENABLE_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_ENABLE_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SIZE_MASK    ((UBase_t) 0x0000003EUL)
#define MPU_RASR2_R_SIZE_BIT    (1UL)
#define MPU_RASR2_R_SIZE_32B    ((UBase_t) 0x00000008UL)
#define MPU_RASR2_R_SIZE_1KB    ((UBase_t) 0x00000012UL)
#define MPU_RASR2_R_SIZE_1MB    ((UBase_t) 0x00000026UL)
#define MPU_RASR2_R_SIZE_1GB    ((UBase_t) 0x0000003AUL)
#define MPU_RASR2_R_SIZE_4GB    ((UBase_t) 0x0000003EUL)

#define MPU_RASR2_SIZE_MASK    ((UBase_t) 0x0000001FUL)
#define MPU_RASR2_SIZE_32B    ((UBase_t) 0x00000004UL)
#define MPU_RASR2_SIZE_1KB    ((UBase_t) 0x00000009UL)
#define MPU_RASR2_SIZE_1MB    ((UBase_t) 0x00000013UL)
#define MPU_RASR2_SIZE_1GB    ((UBase_t) 0x0000001DUL)
#define MPU_RASR2_SIZE_4GB    ((UBase_t) 0x0000001FUL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD0_MASK    ((UBase_t) 0x00000100UL)
#define MPU_RASR2_R_SRD0_BIT    (8UL)
#define MPU_RASR2_R_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD0_DIS    ((UBase_t) 0x00000100UL)

#define MPU_RASR2_SRD0_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD0_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD0_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD1_MASK    ((UBase_t) 0x00000200UL)
#define MPU_RASR2_R_SRD1_BIT    (9UL)
#define MPU_RASR2_R_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD1_DIS    ((UBase_t) 0x00000200UL)

#define MPU_RASR2_SRD1_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD1_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD2_MASK    ((UBase_t) 0x00000400UL)
#define MPU_RASR2_R_SRD2_BIT    (10UL)
#define MPU_RASR2_R_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD2_DIS    ((UBase_t) 0x00000400UL)

#define MPU_RASR2_SRD2_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD2_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD3_MASK    ((UBase_t) 0x00000800UL)
#define MPU_RASR2_R_SRD3_BIT    (11UL)
#define MPU_RASR2_R_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD3_DIS    ((UBase_t) 0x00000800UL)

#define MPU_RASR2_SRD3_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD3_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD4_MASK    ((UBase_t) 0x00001000UL)
#define MPU_RASR2_R_SRD4_BIT    (12UL)
#define MPU_RASR2_R_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD4_DIS    ((UBase_t) 0x00001000UL)

#define MPU_RASR2_SRD4_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD4_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD5_MASK    ((UBase_t) 0x00002000UL)
#define MPU_RASR2_R_SRD5_BIT    (13UL)
#define MPU_RASR2_R_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD5_DIS    ((UBase_t) 0x00002000UL)

#define MPU_RASR2_SRD5_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD5_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD6_MASK    ((UBase_t) 0x00004000UL)
#define MPU_RASR2_R_SRD6_BIT    (14UL)
#define MPU_RASR2_R_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD6_DIS    ((UBase_t) 0x00004000UL)

#define MPU_RASR2_SRD6_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD6_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD7_MASK    ((UBase_t) 0x00008000UL)
#define MPU_RASR2_R_SRD7_BIT    (15UL)
#define MPU_RASR2_R_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_SRD7_DIS    ((UBase_t) 0x00008000UL)

#define MPU_RASR2_SRD7_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_SRD7_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_B_MASK    ((UBase_t) 0x00010000UL)
#define MPU_RASR2_R_B_BIT    (16UL)
#define MPU_RASR2_R_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_B_ENA    ((UBase_t) 0x00010000UL)

#define MPU_RASR2_B_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_B_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_C_MASK    ((UBase_t) 0x00020000UL)
#define MPU_RASR2_R_C_BIT    (17UL)
#define MPU_RASR2_R_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_C_ENA    ((UBase_t) 0x00020000UL)

#define MPU_RASR2_C_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR2_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_C_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR2_R_S_MASK    ((UBase_t) 0x00040000UL)
#define MPU_RASR2_R_S_BIT    (18UL)
#define MPU_RASR2_R_S_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR2_R_S_ENA    ((UBase_t) 0x00040000UL)

