LaloAlvarez-e/ALIENTEK-STM32F767-/STM32F767_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RASR3_SRD1_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD1_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD1_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD2_MASK    ((UBase_t) 0x00000400UL)
#define MPU_RASR3_R_SRD2_BIT    (10UL)
#define MPU_RASR3_R_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD2_DIS    ((UBase_t) 0x00000400UL)

#define MPU_RASR3_SRD2_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD2_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD2_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD3_MASK    ((UBase_t) 0x00000800UL)
#define MPU_RASR3_R_SRD3_BIT    (11UL)
#define MPU_RASR3_R_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD3_DIS    ((UBase_t) 0x00000800UL)

#define MPU_RASR3_SRD3_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD3_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD3_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD4_MASK    ((UBase_t) 0x00001000UL)
#define MPU_RASR3_R_SRD4_BIT    (12UL)
#define MPU_RASR3_R_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD4_DIS    ((UBase_t) 0x00001000UL)

#define MPU_RASR3_SRD4_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD4_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD4_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD5_MASK    ((UBase_t) 0x00002000UL)
#define MPU_RASR3_R_SRD5_BIT    (13UL)
#define MPU_RASR3_R_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD5_DIS    ((UBase_t) 0x00002000UL)

#define MPU_RASR3_SRD5_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD5_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD5_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD6_MASK    ((UBase_t) 0x00004000UL)
#define MPU_RASR3_R_SRD6_BIT    (14UL)
#define MPU_RASR3_R_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD6_DIS    ((UBase_t) 0x00004000UL)

#define MPU_RASR3_SRD6_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD6_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD6_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD7_MASK    ((UBase_t) 0x00008000UL)
#define MPU_RASR3_R_SRD7_BIT    (15UL)
#define MPU_RASR3_R_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_SRD7_DIS    ((UBase_t) 0x00008000UL)

#define MPU_RASR3_SRD7_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_SRD7_ENA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_SRD7_DIS    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_B_MASK    ((UBase_t) 0x00010000UL)
#define MPU_RASR3_R_B_BIT    (16UL)
#define MPU_RASR3_R_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_B_ENA    ((UBase_t) 0x00010000UL)

#define MPU_RASR3_B_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_B_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_B_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_C_MASK    ((UBase_t) 0x00020000UL)
#define MPU_RASR3_R_C_BIT    (17UL)
#define MPU_RASR3_R_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_C_ENA    ((UBase_t) 0x00020000UL)

#define MPU_RASR3_C_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_C_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_C_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_S_MASK    ((UBase_t) 0x00040000UL)
#define MPU_RASR3_R_S_BIT    (18UL)
#define MPU_RASR3_R_S_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_S_ENA    ((UBase_t) 0x00040000UL)

#define MPU_RASR3_S_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_S_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_S_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_TEX_MASK    ((UBase_t) 0x00380000UL)
#define MPU_RASR3_R_TEX_BIT    (19UL)
#define MPU_RASR3_R_TEX_NC    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_TEX_WB_WRA    ((UBase_t) 0x00080000UL)
#define MPU_RASR3_R_TEX_WT_NWA    ((UBase_t) 0x00100000UL)
#define MPU_RASR3_R_TEX_WB_NWA    ((UBase_t) 0x00180000UL)

#define MPU_RASR3_TEX_MASK    ((UBase_t) 0x00000007UL)
#define MPU_RASR3_TEX_NC    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_TEX_WB_WRA    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_TEX_WT_NWA    ((UBase_t) 0x00000002UL)
#define MPU_RASR3_TEX_WB_NWA    ((UBase_t) 0x00000003UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_AP_MASK    ((UBase_t) 0x07000000UL)
#define MPU_RASR3_R_AP_BIT    (24UL)
#define MPU_RASR3_R_AP_NANA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_AP_RWNA    ((UBase_t) 0x01000000UL)
#define MPU_RASR3_R_AP_RWRO    ((UBase_t) 0x02000000UL)
#define MPU_RASR3_R_AP_RWRW    ((UBase_t) 0x03000000UL)
#define MPU_RASR3_R_AP_RONA    ((UBase_t) 0x05000000UL)
#define MPU_RASR3_R_AP_RORO    ((UBase_t) 0x06000000UL)

#define MPU_RASR3_AP_MASK    ((UBase_t) 0x00000007UL)
#define MPU_RASR3_AP_NANA    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_AP_RWNA    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_AP_RWRO    ((UBase_t) 0x00000002UL)
#define MPU_RASR3_AP_RWRW    ((UBase_t) 0x00000003UL)
#define MPU_RASR3_AP_RONA    ((UBase_t) 0x00000005UL)
#define MPU_RASR3_AP_RORO    ((UBase_t) 0x00000006UL)
/*--------*/

/*--------*/
#define MPU_RASR3_R_XN_MASK    ((UBase_t) 0x10000000UL)
#define MPU_RASR3_R_XN_BIT    (28UL)
#define MPU_RASR3_R_XN_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_R_XN_ENA    ((UBase_t) 0x10000000UL)

#define MPU_RASR3_XN_MASK    ((UBase_t) 0x00000001UL)
#define MPU_RASR3_XN_DIS    ((UBase_t) 0x00000000UL)
#define MPU_RASR3_XN_ENA    ((UBase_t) 0x00000001UL)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_MPU_PERIPHERAL_REGISTER_MPU_REGISTERDEFINES_H_ */
